[
    {
        "elements": [
            {
                "type": "title",
                "text": "How is a dictionary different from an array?"
            },
            {
                "type": "body",
                "text": "Suggested approach: It’s all down to how you access data: arrays must be accessed using the index of each element, whereas dictionaries can be accessed using something you define – strings are very common. Make sure and give practical examples of where each would be used."
            },
            {
                "type": "button",
                "text": "More information",
                "action": "https://developer.apple.com/documentation/swift/dictionary"
            }
        ]
    },
    {
        "elements": [
            {
                "type": "title",
                "text": "What are the main differences between classes and structs in Swift?"
            },
            {
                "type": "body",
                "text": "Suggested approach: Your answer ought to include a discussion of value types (like structs) and reference types (like classes), but also the fact that classes allow inheritance."
            },
            {
                "type": "body",
                "text": "For bonus points you could mention that classes have deinit() methods and structs do not."
            },
            {
                "type": "button",
                "text": "More information",
                "action": "https://docs.swift.org/swift-book/documentation/the-swift-programming-language/classesandstructures/"
            }
        ]
    },
    {
        "elements": [
            {
                "type": "title",
                "text": "What are tuples and why are they useful?"
            },
            {
                "type": "body",
                "text": "Suggested approach: Tuples are a bit like anonymous structs, and are helpful for returning multiple values from a method in a type-safe way, among other things. Make sure you go on to provide some explanation of where they might be useful, such as returning two values from an array."
            },
            {
                "type": "button",
                "text": "More information",
                "action": "https://docs.swift.org/swift-book/documentation/the-swift-programming-language/types/"
            }
        ]
    },
    {
        "elements": [
            {
                "type": "title",
                "text": "What does the Codable protocol do?"
            },
            {
                "type": "body",
                "text": "Suggested approach: This protocol was introduced in Swift 4 to let us quickly and safely convert custom Swift types to and from JSON, XML, and similar."
            },
            {
                "type": "body",
                "text": "For bonus points talk about customization points such as key and date decoding strategies, the CodingKey protocol, and more, so that you're able to show you can handle a range of input and output styles."
            },
            {
                "type": "button",
                "text": "More information",
                "action": "https://developer.apple.com/documentation/swift/codable"
            }
        ]
    },
    {
        "elements": [
            {
                "type": "title",
                "text": "What is the difference between an array and a set?"
            },
            {
                "type": "body",
                "text": "Suggested approach: This is a bit like computer science 101, so start by answering with the facts: sets can’t contain duplicates and are unordered, so lookup is significantly faster. Note: this might sound like a trivial question, but the \"significantly faster\" part is critical – sets can be thousands of times faster than arrays depending on how many elements they contain. If you can, go on to give specific examples of where a set would be a better idea than an array."
            },
            {
                "type": "button",
                "text": "More information",
                "action": "https://developer.apple.com/documentation/swift/set"
            }
        ]
    }
]
